# read design
read -sv examples/booth.v
hierarchy -auto-top

# the high-level stuff
proc; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to mycells.lib
dfflibmap -liberty lib/cmos/cmos_cells.lib

# mapping logic to mycells.lib
abc -liberty lib/cmos/cmos_cells.lib

write_blif test.blif

# cleanup
clean
